Autodesk.Revit.DB.CustomExporter.Export(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Exports a collection of 3-D views
Remarks:
It needs be noted that the actual export process may differ
depending on the type of export context used. For example, when the
Autodesk::Revit::DB::IModelExportContext is used,
Revit is likely to perform several rounds of traversing each view, which
may result in invoking the OnViewBegin/OnViewEnd method multiple times
for every one view. It is because Revit draws objects in several layers
(model layer, annotation layer, etc.) and will traverse each layer individually.
In the most common scenario the user will receive two invocations of OnViewBegin/OnViewEnd:
In the first round, all model entities will be received, while in the second round
all text annotation elements will be received, if any present in the given view.
viewIds:
An array of 3-D views to export
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more elements in viewIds is not a valid 3D view.
For example, templates are not considered valid views to export.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The instance of IExportContext is not valid.
-or-
Rendering is currently not supported in the running instance of Revit.
One reason for that to happen is that rendering and material libraries
are not currently available.
Since:
2014

Autodesk.Revit.DB.CustomExporter.Export(Autodesk.Revit.DB.View3D)
Exports one 3-D view
Remarks:
It needs be noted that the actual export process may differ
depending on the type of export context used. For example, when the
Autodesk::Revit::DB::IModelExportContext is used,
Revit is likely to perform several rounds of traversing each view, which
may result in invoking the OnViewBegin/OnViewEnd method multiple times
for every one view. It is because Revit draws objects in several layers
(model layer, annotation layer, etc.) and will traverse each layer individually.
In the most common scenario the user will receive two invocations of OnViewBegin/OnViewEnd:
In the first round, all model entities will be received, while in the second round
all text annotation elements will be received, if any present in the given view.
view:
An instance of the 3-D view to export
Throws Autodesk.Revit.Exceptions.ArgumentException:
The view is not exportable, such as a template view, for example.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The instance of IExportContext is not valid.
-or-
Rendering is currently not supported in the running instance of Revit.
One reason for that to happen is that rendering and material libraries
are not currently available.
Since:
2014

Autodesk.Revit.DB.CustomExporter.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.IExportContext)
Constructs a new instance of a CustomExporter for a given document
using the input instance of IExportContext as the output device.
Remarks:
The input context should be an instance of a class that implements
either Autodesk::Revit::DB::IModelExportContext
or Autodesk::Revit::DB::IPhotoRenderContext interfaces.
document:
The document containing the model to be exported
context:
An instance of a context class that will be consuming the output
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.CustomExporter
A class that allows exporting 3D views via an export context.
Remarks:
The Export method of this class triggers standard rendering or exporting
process in Revit, but instead of displaying the result on screen or printer,
the output is channeled through the given custom context that handles
processing of the geometric as well as non-geometric information.
Revit will process the exporting algorithm depending on the type
of given context. If an instance of Autodesk::Revit::DB::IPhotoRenderContext
is used, then Revit will output the model as if executing the Render command,
thus only such entities that would be visible in a rendered view
will be sent to the context.
Alternatively, if an instance of Autodesk::Revit::DB::IModelExportContext
is used, Revit will output the model as if exporting it to a CAD format,
a process which results outputting also objects that would not
appear in a rendered image, such as model curves and text annotations.
Since:
2014